In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv("50_Startups.csv")

In [4]:
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   R&D Spend        50 non-null     float64
 1   Administration   50 non-null     float64
 2   Marketing Spend  50 non-null     float64
 3   State            50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [6]:
len(df)

50

In [7]:
df.shape

(50, 5)

In [10]:
df.describe()

           R&D Spend  Administration  Marketing Spend         Profit
count      50.000000       50.000000        50.000000      50.000000
mean    73721.615600   121344.639600    211025.097800  112012.639200
std     45902.256482    28017.802755    122290.310726   40306.180338
min         0.000000    51283.140000         0.000000   14681.400000
25%     39936.370000   103730.875000    129300.132500   90138.902500
50%     73051.080000   122699.795000    212716.240000  107978.190000
75%    101602.800000   144842.180000    299469.085000  139765.977500
max    165349.200000   182645.560000    471784.100000  192261.830000

In [11]:
df.isnull().sum()

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [33]:
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [35]:
df['State'].unique()

array(['New York', 'California', 'Florida'], dtype=object)

In [36]:
df['State'].value_counts()

New York      17
California    17
Florida       16
Name: State, dtype: int64

In [39]:
c = pd.get_dummies(df['State'] , drop_first = True)

In [40]:
c.head()

   Florida  New York
0        0         1
1        0         0
2        1         0
3        0         1
4        1         0

In [41]:
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [42]:
df = df.drop(['State'] , axis = 1)

In [43]:
df.head()

   R&D Spend  Administration  Marketing Spend     Profit
0  165349.20       136897.80        471784.10  192261.83
1  162597.70       151377.59        443898.53  191792.06
2  153441.51       101145.55        407934.54  191050.39
3  144372.41       118671.85        383199.62  182901.99
4  142107.34        91391.77        366168.42  166187.94

In [44]:
df = pd.concat([df , c] , axis = 1)

In [45]:
df.head()

   R&D Spend  Administration  Marketing Spend     Profit  Florida  New York
0  165349.20       136897.80        471784.10  192261.83        0         1
1  162597.70       151377.59        443898.53  191792.06        0         0
2  153441.51       101145.55        407934.54  191050.39        1         0
3  144372.41       118671.85        383199.62  182901.99        0         1
4  142107.34        91391.77        366168.42  166187.94        1         0

In [46]:
from sklearn.model_selection import train_test_split

In [47]:
X = df.drop(['Profit'] , axis = 1)
y = df['Profit']

In [48]:
X.head()

   R&D Spend  Administration  Marketing Spend  Florida  New York
0  165349.20       136897.80        471784.10        0         1
1  162597.70       151377.59        443898.53        0         0
2  153441.51       101145.55        407934.54        1         0
3  144372.41       118671.85        383199.62        0         1
4  142107.34        91391.77        366168.42        1         0

In [49]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [50]:
X_train , X_test , y_train , y_test = train_test_split(X , y , test_size = 0.33 , random_state = 1)

In [51]:
X_train.head()

    R&D Spend  Administration  Marketing Spend  Florida  New York
26   75328.87       144135.98        134050.07        1         0
22   73994.56       122782.75        303319.26        1         0
13   91992.39       135495.07        252664.93        0         0
41   27892.92        84710.77        164470.71        1         0
17   94657.16       145077.58        282574.31        0         1

In [52]:
y_train.head()

26    105733.54
22    110352.25
13    134307.35
41     77798.83
17    125370.37
Name: Profit, dtype: float64

In [53]:
X_test.head()

    R&D Spend  Administration  Marketing Spend  Florida  New York
27   72107.60       127864.55        353183.81        0         1
35   46014.02        85047.44        205517.64        0         1
40   28754.33       118546.05        172795.67        0         0
38   20229.59        65947.93        185265.10        0         1
2   153441.51       101145.55        407934.54        1         0

In [54]:
y_test.head()

27    105008.31
35     96479.51
40     78239.91
38     81229.06
2     191050.39
Name: Profit, dtype: float64

In [55]:
len(X_train) , len(y_train) , len(X_test) , len(y_test)

(33, 33, 17, 17)

In [56]:
from sklearn.linear_model import LinearRegression

In [57]:
reg = LinearRegression()

In [58]:
reg.fit(X_train , y_train )

LinearRegression()

In [59]:
reg.coef_

array([ 7.19814259e-01, -1.79470419e-02,  3.74987995e-02, -3.58982365e+03,
       -2.68346328e+03])

In [60]:
reg.intercept_

56347.241628439835

In [61]:
y_train_pred = reg.predict(X_train)

In [62]:
from sklearn.metrics import r2_score

In [63]:
r2_score(y_train , y_train_pred)

0.964227599693118

In [64]:
reg.score(X_train , y_train)

0.964227599693118

In [65]:
y_test_pred = reg.predict(X_test)

In [66]:
r2_score(y_test , y_test_pred)

0.8989116927522569

In [67]:
reg.score(X_test , y_test)

0.8989116927522569

In [68]:
X_train.head()

    R&D Spend  Administration  Marketing Spend  Florida  New York
26   75328.87       144135.98        134050.07        1         0
22   73994.56       122782.75        303319.26        1         0
13   91992.39       135495.07        252664.93        0         0
41   27892.92        84710.77        164470.71        1         0
17   94657.16       145077.58        282574.31        0         1

In [69]:
reg.predict([[23 , 14.84 , 16.84 , 0 , 0]])

array([56364.16250209])